Datan muuntaminen

In [1]:
import pandas as pd

df = pd.read_excel('https://taanila.fi/data1.xlsx')
df

,nro,sukup,ikä,perhe,koulutus,palveluv,palkka,johto,työtov,työymp,palkkat,työteht,työterv,lomaosa,kuntosa,hieroja
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,NaN,NaN,NaN,NaN
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,NaN,NaN,NaN,NaN
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,1.0,NaN,NaN,NaN
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,1.0,NaN,NaN,NaN
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,1.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,NaN,1.0,1.0,NaN
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,1.0,NaN,NaN,NaN
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,1.0,NaN,1.0,NaN
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,NaN,NaN,NaN,NaN
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,1.0,NaN,NaN,NaN

In [2]:
df.columns

Index(['nro', 'sukup', 'ikä', 'perhe', 'koulutus', 'palveluv', 'palkka',
       'johto', 'työtov', 'työymp', 'palkkat', 'työteht', 'työterv', 'lomaosa',
       'kuntosa', 'hieroja'],
      dtype='object')

In [3]:
#Muutetaan sarakkeiden nimet sukup = sukupuoli, palveluv = palveluvuodet perhe = perhesuhde
df.columns = ['nro', 'sukupuoli', 'ikä', 'perhesuhde', 'koulutus', 'palveluvuodet', 'palkka',
       'johto', 'työtov', 'työymp', 'palkkat', 'työteht', 'työterv', 'lomaosa',
       'kuntosa', 'hieroja']
df.columns

Index(['nro', 'sukupuoli', 'ikä', 'perhesuhde', 'koulutus', 'palveluvuodet',
       'palkka', 'johto', 'työtov', 'työymp', 'palkkat', 'työteht', 'työterv',
       'lomaosa', 'kuntosa', 'hieroja'],
      dtype='object')

In [4]:
#Myös raname() funtiolla pystyy muuttamaan. Tarvitaan sanakirja {}
df = df.rename(columns={"sukupuoli":"sukup", "perhesuhde":"perhe", "palveluvuodet":"palvelup"})
df.columns

Index(['nro', 'sukup', 'ikä', 'perhe', 'koulutus', 'palvelup', 'palkka',
       'johto', 'työtov', 'työymp', 'palkkat', 'työteht', 'työterv', 'lomaosa',
       'kuntosa', 'hieroja'],
      dtype='object')

Sarakkeiden poistaminen

In [5]:
#Drop funktiolla
#Derop postaa oletuksena rivejä AXIS=0, sarakkeet ovat AXIS=1
df1 = df.drop(["työterv", "lomaosa", "kuntosa", "hieroja"], axis=1)
df1

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4

Indeksi

In [6]:
#Muutuja nro siirretään indeksiin set_index() funtiolla
df1 = df1.set_index("nro")
df1

,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht
nro,,,,,,,,,,,
1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2
...,...,...,...,...,...,...,...,...,...,...,...
78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4
79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2
80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3
81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3
82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4

In [7]:
#reset_index muuttaa sen takaisin tavalliseksi sarakkeeksi
df1 = df1.reset_index()
df1

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4

Virheellisten arvojen korjaaminen

In [ ]:
#Korjataan virheellisen iän ikään 42 indeksinumeron 47 rivillä
df1.loc[47, "ikä"] = 42
#Katsotaan onko indeksinumeron 47 ikä rivillä 42
df1.iloc[40:50]

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht
40,41,1,33,2,3.0,9.0,2846,3,3.0,4,2,3
41,42,1,29,1,2.0,6.0,2534,3,4.0,3,1,2
42,43,2,40,2,3.0,12.0,2144,4,4.0,4,4,4
43,44,1,30,1,2.0,7.0,2223,2,3.0,4,1,3
44,45,1,55,2,1.0,35.0,2651,4,5.0,4,2,4
45,46,2,51,2,1.0,28.0,1989,3,3.0,2,2,3
46,47,2,22,1,3.0,21.0,1872,3,3.0,4,1,3
47,48,1,42,2,1.0,18.0,2183,4,5.0,4,1,3
48,49,1,27,2,2.0,7.0,2729,4,4.0,3,3,5
49,50,1,29,1,3.0,7.0,2340,3,4.0,3,2,3

Uusien sarakkeiden luonti

In [9]:
#Luodaan sukupuoli_str, jossa sukupuolet ovat tekstinä
#Käytetään sanakirjaa
df1["sukupuoli_str"] = df1["sukup"].replace({1:"Mies", 2:"Nainen"})
df1

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht,sukupuoli_str
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,Mies
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,Mies
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,Mies
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,Mies
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,Mies
...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,Mies
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,Mies
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,Mies
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,Mies
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,Nainen

In [10]:
#Luodaan luokkarajat ikäluokille. HUOMAA, ETTÄ PITÄÄ OLLA SAMANLAISET HYPPÄYKSET
bins = [19, 29, 39, 49, 59, 69]

#Luodaan uusisarake, jossa iät on luokiteltu ikäluokkiin
df1["ikäluokka"] = pd.cut(df1["ikä"], bins=bins)

df1

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht,sukupuoli_str,ikäluokka
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,Mies,"(29, 39]"
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,Mies,"(19, 29]"
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,Mies,"(29, 39]"
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,Mies,"(29, 39]"
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,Mies,"(19, 29]"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,Mies,"(19, 29]"
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,Mies,"(29, 39]"
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,Mies,"(19, 29]"
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,Mies,"(29, 39]"
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,Nainen,"(29, 39]"

In [11]:
#Lasketaan vastaajan "kokonaistyytyväisyyden" keskiarvona tyytyväiksyyksistä eri osa-alueilla
#axis=1 tarkoittaa laskemista sivusuunnassa! Rivien keskiarvo
df1["tyytyväisyys"] = df1[["johto", "työtov", "työymp", "palkkat", "työteht"]].mean(axis=1)

df1[["johto", "työtov", "työymp", "palkkat", "työteht", "tyytyväisyys"]]

    johto  työtov  työymp  palkkat  työteht  tyytyväisyys
0       3     3.0       3        3        3           3.0
1       1     5.0       2        1        3           2.4
2       3     4.0       1        1        3           2.4
3       3     3.0       3        3        3           3.0
4       2     3.0       2        1        2           2.0
..    ...     ...     ...      ...      ...           ...
77      4     4.0       4        3        4           3.8
78      1     3.0       2        1        2           1.8
79      3     4.0       3        3        3           3.2
80      3     4.0       3        3        3           3.2
81      3     4.0       4        3        4           3.6

[82 rows x 6 columns]

In [12]:
#Uusi sarake, jossa on laskettu käytettyjen etuuksien lukumäärä .count
df["käyttö"] = df[["työterv", "lomaosa", "kuntosa", "hieroja"]].count(axis=1)
df[["työterv", "lomaosa", "kuntosa", "hieroja", "käyttö"]]

    työterv  lomaosa  kuntosa  hieroja  käyttö
0       NaN      NaN      NaN      NaN       0
1       NaN      NaN      NaN      NaN       0
2       1.0      NaN      NaN      NaN       1
3       1.0      NaN      NaN      NaN       1
4       1.0      NaN      NaN      NaN       1
..      ...      ...      ...      ...     ...
77      NaN      1.0      1.0      NaN       2
78      1.0      NaN      NaN      NaN       1
79      1.0      NaN      1.0      NaN       2
80      NaN      NaN      NaN      NaN       0
81      1.0      NaN      NaN      NaN       1

[82 rows x 5 columns]

Puuttuvia arvoja sisältävien rivien poistaminen

In [14]:
#Poistetaan rivit, joilta puuttuu näiden sarakkeiden arvot

df2 = df1.dropna(subset=["koulutus", "palvelup", "työtov"])
df2

,nro,sukup,ikä,perhe,koulutus,palvelup,palkka,johto,työtov,työymp,palkkat,työteht,sukupuoli_str,ikäluokka,tyytyväisyys
0,1,1,38,1,1.0,22.0,3587,3,3.0,3,3,3,Mies,"(29, 39]",3.0
1,2,1,29,2,2.0,10.0,2963,1,5.0,2,1,3,Mies,"(19, 29]",2.4
2,3,1,30,1,1.0,7.0,1989,3,4.0,1,1,3,Mies,"(29, 39]",2.4
3,4,1,36,2,1.0,14.0,2144,3,3.0,3,3,3,Mies,"(29, 39]",3.0
4,5,1,24,1,2.0,4.0,2183,2,3.0,2,1,2,Mies,"(19, 29]",2.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
77,78,1,22,1,3.0,0.0,1598,4,4.0,4,3,4,Mies,"(19, 29]",3.8
78,79,1,33,1,1.0,2.0,1638,1,3.0,2,1,2,Mies,"(29, 39]",1.8
79,80,1,27,1,2.0,7.0,2612,3,4.0,3,3,3,Mies,"(19, 29]",3.2
80,81,1,35,2,2.0,16.0,2808,3,4.0,3,3,3,Mies,"(29, 39]",3.2
81,82,2,35,2,3.0,15.0,2183,3,4.0,4,3,4,Nainen,"(29, 39]",3.6